from osm_ru_nametag_validator.name_conditions.variant2 import (
    is_noun,
    is_adj,
    is_variant2
)

valid_nouns = [
    'Камень',
    'Варенье',
    'Логиярви',
    'Байкал',
    'Сямозеро',
    'ЗАМОЗЕРО'
]

valid_variant2_names = [
    'озеро Байкал',
    'Ладожское озеро',
    'Нижнее озеро',
    'Нижнее озеро ',
    'озеро Логиярви',
    'озеро Сямозеро',
    'озеро Сухое Озеро',
    'озеро ЗАМОЗЕРО',

    'Мелкие озёра',
    'озёра Путорц',
    'озера Близнецы',

    'первое озеро',
    'Первое озеро',
    'второе озеро',
    'Второе озеро',
    'третье озеро',
    'Третье озеро',
    'четвёртое озеро',
    'Чётвертое озеро',
    'пятое озеро',
    'Пятое озеро',
    'шестое озеро',
    'Шестое озеро',
    'седьмое озеро',
    'Седьмое озеро',
    'восьмое озеро',
    'Восьмое озеро',
    'девятое озеро',
    'Девятое озеро',
    'десятое озеро',
    'Десятое озеро',
    'одиннадцатое озеро',
    'Одиннадцатое озеро',
    'мегаквадрасупердуперионное озеро',
    'Мегаквадрасупердуперионное озеро',
    'МЕГАКВДРАСУПЕЕРДУПЕРИОННОЕ озеро',

]

non_valid_variant2_names = [
    'озероозеро',
    'озёраОзери',
    ' озеро Что',
    'ОЗЕРО Озерище'

    'Байкал',
    'Озеро Байкал',
    'озеро Нижнее',
    'озеро Ладожское',
    'озеро Ладожское ',
    'Логиярви',
    'Сямозеро',
    'Сухое Озеро',

    'озеро первое',
    'озеро Первое',
    'озеро второе',
    'озеро Второе',
    'озеро третье',
    'озеро Третье',
    'озеро четвёртое',
    'озеро Чётвертое',
    'озеро пятое',
    'озеро Пятое',
    'озеро шестое',
    'озеро Шестое',
    'озеро седьмое',
    'озеро Седьмое',
    'озеро восьмое',
    'озеро Восьмое',
    'озеро девятое',
    'озеро Девятое',
    'озеро десятое',
    'озеро Десятое',
    'озеро одиннадцатое',
    'озеро Одиннадцатое',
    'озеро мегаквадрасупердуперионное',
    'озеро Мегаквадрасупердуперионное',
    'озеро МЕГАКВДРАСУПЕЕРДУПЕРИОННОЕ',
]


def test_is_variant2():
    for word in valid_nouns:
        assert is_noun(word)

    for name in valid_variant2_names:
        assert is_variant2(name)

    for name in non_valid_variant2_names:
        assert not is_variant2(name)
