from osm_ru_nametag_validator.name_conditions.variant4 import (
    is_adjf,
    is_gent,
    is_variant4
)
valid_adjf = [
    'Нижнее',
    'Ладожское',
    'Первое',
    'второе',
    'Русское',
]

valid_gent = [
    'Стали',
    'Бочарова',
    'Левинсон-Лессинга',
    'озеро Мерцбахера',
]


valid_nouns = [
    'Камень',
    'Варенье',
    'Портной',
    'Стали',

    'Логиярви',
    'Байкал',
    'Сямозеро',
    'ЗАМОЗЕРО',
]


valid_variant4_names = [
    'Байкал',
    'Ладожское озеро',
    'Нижнее озеро',
    'Нижнее озеро ',
    'Карачево озеро',
    'Сямозеро',
    'Логиярви',
    'Сухое Озеро',
    'Большое Ушницкое озеро',
    'Русское озеро',
    'Озероозеро',


    'Мелкие озёра',

    'первое озеро',
    'Первое озеро',
    'второе озеро',
    'Второе озеро',
    'третье озеро',
    'Третье озеро',
    'четвёртое озеро',
    'Чётвертое озеро',
    'пятое озеро',
    'Пятое озеро',
    'шестое озеро',
    'Шестое озеро',
    'седьмое озеро',
    'Седьмое озеро',
    'восьмое озеро',
    'Восьмое озеро',
    'девятое озеро',
    'Девятое озеро',
    'десятое озеро',
    'Десятое озеро',
    'одиннадцатое озеро',
    'Одиннадцатое озеро',
    'мегаквадрасупердуперионное озеро',
    'Мегаквадрасупердуперионное озеро',
    'МЕГАКВДРАСУПЕЕРДУПЕРИОННОЕ озеро',

]

non_valid_variant4_names = [
    'озёра Озерь',

    'озеро Байкал',
    'озеро Логиярви',
    'озеро Нижнее',
    'озеро Карачево',
    'озеро Ладожское',
    'озеро Ладожское ',
    'озеро Сямозеро', 'озеро Сухое Озеро',
    'озеро ЗАМОЗЕРО',
    'озеро Большой Кременкуль',
    ' озеро Что ',

    'Нижнее',
    'Ладожское',
    'Первое',
    'второе',
    'Русское',

    'озёра Путорц',
    'озера Близнецы',

    'озеро первое',
    'озеро Первое',
    'озеро второе',
    'озеро Второе',
    'озеро третье',
    'озеро Третье',
    'озеро четвёртое',
    'озеро Чётвертое',
    'озеро пятое',
    'озеро Пятое',
    'озеро шестое',
    'озеро Шестое',
    'озеро седьмое',
    'озеро Седьмое',
    'озеро восьмое',
    'озеро Восьмое',
    'озеро девятое',
    'озеро Девятое',
    'озеро десятое',
    'озеро Десятое',
    'озеро одиннадцатое',
    'озеро Одиннадцатое',
    'озеро мегаквадрасупердуперионное',
    'озеро Мегаквадрасупердуперионное',
    'озеро МЕГАКВДРАСУПЕЕРДУПЕРИОННОЕ',
]


def test_is_variant4():
    for word in valid_adjf:
        assert is_adjf(word)
    for word in valid_nouns:
        assert not is_adjf(word)
    for word in valid_gent:
        assert is_gent(word)

    for name in valid_variant4_names:
        assert is_variant4(name)
    for name in non_valid_variant4_names:
        assert not is_variant4(name)
