from osm_ru_nametag_validator.name_conditions.variant3 import (
    is_compound,
    is_adjf,
    is_variant3
)
valid_adjf = [
    'Нижнее',
    'Ладожское',
    'Первое',
    'второе',
    'Русское',
]

valid_gent = [
    'Стали',
    'Бочарова',
    'Левинсон-Лессинга',
    'озеро Мерцбахера',
]


valid_nouns = [
    'Камень',
    'Варенье',
    'Портной',
    'Стали',

    'Логиярви',
    'Байкал',
    'Сямозеро',
    'ЗАМОЗЕРО',
]


valid_variant3_names = [
    'озеро Байкал',
    'Ладожское озеро',
    'Нижнее озеро',
    'Нижнее озеро ',
    'Карачево озеро',
    'Сямозеро',
    'озеро Логиярви',
    'Сухое Озеро',
    'озеро ЗАМОЗЕРО',
    'озеро Большой Кременкуль',
    'Большое Ушницкое озеро',
    'Русское озеро',
    ' озеро Что ',
    'Озероозеро',


    'Мелкие озёра',
    'озёра Путорц',
    'озера Близнецы',

    'первое озеро',
    'Первое озеро',
    'второе озеро',
    'Второе озеро',
    'третье озеро',
    'Третье озеро',
    'четвёртое озеро',
    'Чётвертое озеро',
    'пятое озеро',
    'Пятое озеро',
    'шестое озеро',
    'Шестое озеро',
    'седьмое озеро',
    'Седьмое озеро',
    'восьмое озеро',
    'Восьмое озеро',
    'девятое озеро',
    'Девятое озеро',
    'десятое озеро',
    'Десятое озеро',
    'одиннадцатое озеро',
    'Одиннадцатое озеро',
    'мегаквадрасупердуперионное озеро',
    'Мегаквадрасупердуперионное озеро',
    'МЕГАКВДРАСУПЕЕРДУПЕРИОННОЕ озеро',

]

non_valid_variant3_names = [
    'озёра Озери',

    'Байкал',
    'Логиярви',
    'озеро Нижнее',
    'озеро Карачево',
    'озеро Ладожское',
    'озеро Ладожское ',
    'озеро Сямозеро',
    'озеро Сухое Озеро',

    'Нижнее',
    'Ладожское',
    'Первое',
    'второе',
    'Русское',

    'озеро первое',
    'озеро Первое',
    'озеро второе',
    'озеро Второе',
    'озеро третье',
    'озеро Третье',
    'озеро четвёртое',
    'озеро Чётвертое',
    'озеро пятое',
    'озеро Пятое',
    'озеро шестое',
    'озеро Шестое',
    'озеро седьмое',
    'озеро Седьмое',
    'озеро восьмое',
    'озеро Восьмое',
    'озеро девятое',
    'озеро Девятое',
    'озеро десятое',
    'озеро Десятое',
    'озеро одиннадцатое',
    'озеро Одиннадцатое',
    'озеро мегаквадрасупердуперионное',
    'озеро Мегаквадрасупердуперионное',
    'озеро МЕГАКВДРАСУПЕЕРДУПЕРИОННОЕ',
]


def test_is_variant3():
    for word in valid_adjf:
        assert is_adjf(word)
    for word in valid_nouns:
        assert not is_adjf(word)

    for name in valid_variant3_names:
        assert is_variant3(name)
    for name in non_valid_variant3_names:
        assert not is_variant3(name)
