from osm_ru_nametag_validator.name_conditions.variant3 import (
    is_compound,
    is_adjf,
    is_variant3
)

valid_adjf = [
    'Нижнее',
    'Ладожское',
    'Первое',
    'второе',
    'Русское',
]

valid_nouns = [
    'Камень',
    'Варенье',
    'Портной',
    'Стали',

    'Логиярви',
    'Байкал',
    'Сямозеро',
    'ЗАМОЗЕРО',
]

valid_compounds = [
    'Сямозеро',
    'Лемозеро',
    'ЗАМОЗЕРО',
    'Чудо-озеро',
    'Озеро',
    'Озерище',
    'Озерки'
]

invalid_compounds = [
    'Оооооо',
    'озеро',
    'озера',
    'озёра',
    'колесо',
    'река',
    'Логиярви',
    'Байкал',
    'Чудское',
    'Озеозе',
]

valid_variant3_names = [
    'озеро Байкал',
    'Ладожское озеро',
    'Нижнее озеро',
    'Нижнее озеро ',
    'Карачево озеро',
    'Сямозеро',
    'Ламозеро',
    'Озерки',
    'Озерище',
    'Чудо-озеро',
    'озеро Логиярви',
    'Сухое Озеро',
    'озеро Большой Кременкуль',
    'Большое Ушницкое озеро',
    'Русское озеро',
    ' озеро Что ',
    'Озероозеро',

    'озеро Бочарова',
    'озеро Большого Бочарова',
    'озеро Левинсон-Лессинга',
    'озеро Мерцбахера',
    'озеро Толмачёва',
    'озеро Усачёва',
    'озеро Вязок',

    'Мелкие озёра',
    'Конопляные озера',
    'озёра Путорц',
    'озера Близнецы',

    'первое озеро',
    'Первое озеро',
    'второе озеро',
    'Второе озеро',
    'третье озеро',
    'Третье озеро',
    'четвёртое озеро',
    'Чётвертое озеро',
    'пятое озеро',
    'Пятое озеро',
    'шестое озеро',
    'Шестое озеро',
    'седьмое озеро',
    'Седьмое озеро',
    'восьмое озеро',
    'Восьмое озеро',
    'девятое озеро',
    'Девятое озеро',
    'десятое озеро',
    'Десятое озеро',
    'одиннадцатое озеро',
    'Одиннадцатое озеро',
    'мегаквадрасупердуперионное озеро',
    'Мегаквадрасупердуперионное озеро',
    'МЕГАКВДРАСУПЕЕРДУПЕРИОННОЕ озеро',

]

non_valid_variant3_names = [
    'Байкал',
    'Логиярви',

    'озеро Нижнее',
    'озеро Карачево',
    'озеро Ладожское',
    'озеро Ладожское ',
    'озеро Сямозеро',
    'озеро Сухое Озеро',
    'озеро ЗАМОЗЕРО',
    'озера Озерки',
    'озёра Озери',
    'озёра Озерь',
    'Озерище озеро',
    'озеро Озерище',

    'Нижнее',
    'Ладожское',
    'Первое',
    'второе',
    'Русское',

    'Бочарова',
    'Большого Бочарова',
    'Левинсон-Лессинга',
    'Мерцбахера',
    'Толмачёва',
    'Усачёва',
    'Вязок',
    'Бочарова',
    'Большого Бочарова озеро',
    'Левинсон-Лессинга озеро',
    'Мерцбахера озеро',
    'Толмачёва озеро',
    'Усачёва озеро',
    'Вязок озеро',

    'озеро первое',
    'озеро Первое',
    'озеро второе',
    'озеро Второе',
    'озеро третье',
    'озеро Третье',
    'озеро четвёртое',
    'озеро Чётвертое',
    'озеро пятое',
    'озеро Пятое',
    'озеро шестое',
    'озеро Шестое',
    'озеро седьмое',
    'озеро Седьмое',
    'озеро восьмое',
    'озеро Восьмое',
    'озеро девятое',
    'озеро Девятое',
    'озеро десятое',
    'озеро Десятое',
    'озеро одиннадцатое',
    'озеро Одиннадцатое',
    'озеро мегаквадрасупердуперионное',
    'озеро Мегаквадрасупердуперионное',
    'озеро МЕГАКВДРАСУПЕЕРДУПЕРИОННОЕ',
]


def test_is_variant3():
    for word in valid_adjf:
        assert is_adjf(word)
    for word in valid_nouns:
        assert not is_adjf(word)
    for word in valid_compounds:
        assert is_compound(word)
    for word in invalid_compounds:
        assert not is_compound(word)

    for name in valid_variant3_names:
        assert is_variant3(name)
    for name in non_valid_variant3_names:
        assert not is_variant3(name)
