from osm_ru_nametag_validator.name_conditions.variant2 import (
    is_adjf,
    is_variant2
)
valid_adjf = [
    'Нижнее',
    'Ладожское',
    'Первое',
    'второе',
    'Русское',
]

valid_nouns = [
    'Камень',
    'Варенье',
    'Портной',
    'Стали',

    'Логиярви',
    'Байкал',
    'Сямозеро',
    'ЗАМОЗЕРО',
]


valid_variant2_names = [
    'озеро Байкал',
    'Ладожское озеро',
    'Нижнее озеро',
    'Нижнее озеро ',
    'Карачево озеро',
    'озеро Логиярви',
    'озеро Сямозеро',
    'озеро Сухое Озеро',
    'озеро ЗАМОЗЕРО',
    'озеро Большой Кременкуль',
    'Большое Ушницкое озеро',
    'Русское озеро',
    'озёра Озерь',
    ' озеро Что ',

    'озеро Бочарова',
    'озеро Большого Бочарова',
    'озеро Левинсон-Лессинга',
    'озеро Мерцбахера',
    'озеро Толмачёва',
    'озеро Усачёва',
    'озеро Вязок',

    'Мелкие озёра',
    'Конопляные озера',
    'озёра Путорц',
    'озера Близнецы',

    'первое озеро',
    'Первое озеро',
    'второе озеро',
    'Второе озеро',
    'третье озеро',
    'Третье озеро',
    'четвёртое озеро',
    'Чётвертое озеро',
    'пятое озеро',
    'Пятое озеро',
    'шестое озеро',
    'Шестое озеро',
    'седьмое озеро',
    'Седьмое озеро',
    'восьмое озеро',
    'Восьмое озеро',
    'девятое озеро',
    'Девятое озеро',
    'десятое озеро',
    'Десятое озеро',
    'одиннадцатое озеро',
    'Одиннадцатое озеро',
    'мегаквадрасупердуперионное озеро',
    'Мегаквадрасупердуперионное озеро',
    'МЕГАКВДРАСУПЕЕРДУПЕРИОННОЕ озеро',

]

non_valid_variant2_names = [
    'озероозеро',
    'Озероозеро',
    'озёраОзери',
    'ОЗЕРО Озерище'

    'Байкал',
    'Озеро Байкал',
    'озеро Нижнее',
    'озеро Карачево',
    'озеро Ладожское',
    'озеро Ладожское ',
    'Логиярви',
    'Сямозеро',
    'ЗАМОЗЕРО',
    'Большой Кременкуль',
    'Сухое Озеро',
    'Озерки',
    'Озерище',
    'Чудо-озеро',

    'Нижнее',
    'Ладожское',
    'Первое',
    'второе',
    'Русское',

    'Бочарова',
    'Большого Бочарова',
    'Левинсон-Лессинга',
    'Мерцбахера',
    'Толмачёва',
    'Усачёва',
    'Вязок',
    'Бочарова',
    'Большого Бочарова озеро',
    'Левинсон-Лессинга озеро',
    'Мерцбахера озеро',
    'Толмачёва озеро',
    'Усачёва озеро',
    'Вязок озеро',

    'озеро первое',
    'озеро Первое',
    'озеро второе',
    'озеро Второе',
    'озеро третье',
    'озеро Третье',
    'озеро четвёртое',
    'озеро Чётвертое',
    'озеро пятое',
    'озеро Пятое',
    'озеро шестое',
    'озеро Шестое',
    'озеро седьмое',
    'озеро Седьмое',
    'озеро восьмое',
    'озеро Восьмое',
    'озеро девятое',
    'озеро Девятое',
    'озеро десятое',
    'озеро Десятое',
    'озеро одиннадцатое',
    'озеро Одиннадцатое',
    'озеро мегаквадрасупердуперионное',
    'озеро Мегаквадрасупердуперионное',
    'озеро МЕГАКВДРАСУПЕЕРДУПЕРИОННОЕ',
]


def test_is_variant2():
    for word in valid_adjf:
        assert is_adjf(word)
    for word in valid_nouns:
        assert not is_adjf(word)

    for name in valid_variant2_names:
        assert is_variant2(name)
    for name in non_valid_variant2_names:
        assert not is_variant2(name)
