from osm_ru_nametag_validator.name_conditions.variant1 import is_variant1

valid_variant1_names = [
    'озеро Байкал',
    'озеро Ладожское',
    'озеро Нижнее',
    'озеро Логиярви',
    'озеро Сямозеро',
    'озеро Сухое Озеро',
    'озеро ЗАМОЗЕРО',

    'озёра Мелкие',
    'озёра Путорц',
    'озера Близнецы',

    'озеро первое',
    'озеро Первое',
    'озеро второе',
    'озеро Второе',
    'озеро третье',
    'озеро Третье',
    'озеро четвёртое',
    'озеро Чётвертое',
    'озеро пятое',
    'озеро Пятое',
    'озеро шестое',
    'озеро Шестое',
    'озеро седьмое',
    'озеро Седьмое',
    'озеро восьмое',
    'озеро Восьмое',
    'озеро девятое',
    'озеро Девятое',
    'озеро десятое',
    'озеро Десятое',
    'озеро одиннадцатое',
    'озеро Одиннадцатое',
    'озеро мегаквадрасупердуперионное',
    'озеро Мегаквадрасупердуперионное',
    'озеро МЕГАКВДРАСУПЕЕРДУПЕРИОННОЕ',
]

non_valid_variant1_names = [
    'озероозеро',
    'озёраОзери',
    ' озеро Что',
    'ОЗЕРО Озерище'

    'Байкал',
    'Озеро Байкал',
    'Нижнее озеро',
    'Ладожское озеро',
    'Логиярви',
    'Сямозеро',
    'Сухое Озеро',

    'первое озеро',
    'Первое озеро',
    'второе озеро',
    'Второе озеро',
    'третье озеро',
    'Третье озеро',
    'четвёртое озеро',
    'Чётвертое озеро',
    'пятое озеро',
    'Пятое озеро',
    'шестое озеро',
    'Шестое озеро',
    'седьмое озеро',
    'Седьмое озеро',
    'восьмое озеро',
    'Восьмое озеро',
    'девятое озеро',
    'Девятое озеро',
    'десятое озеро',
    'Десятое озеро',
    'одиннадцатое озеро',
    'Одиннадцатое озеро',
    'мегаквадрасупердуперионное озеро',
    'Мегаквадрасупердуперионное озеро',
    'МЕГАКВДРАСУПЕЕРДУПЕРИОННОЕ озеро',
]


def test_is_variant1():
    for name in valid_variant1_names:
        assert is_variant1(name)

    for name in non_valid_variant1_names:
        assert not is_variant1(name)
