import re

# Edge-cases: ГВР ( https://textual.ru/gvr/index.php ), ГКГН
unique = {
    ('relation', '2650915'),   # Сухое Озеро
    ('way', '42284126'),       # Нижнее Озеро
    ('way', '60336224'),       # Ремез Озеро
    ('relation', '6665967'),   # Турье Озеро
    ('way', '143824327'),      # Малое Белое Озеро
    ('way', '42284166'),       # Чёрное Озеро
    # Большое Озеро (50.343611,106.934722)
    # Малое Озеро (53.47192,159.79919)
    # Большое Озеро (53.0459,46.0538)
    # Шубинское Озеро (57.36666667,64.91666667)
    # Большое Озеро (52.936111,41.643056)
    # Чёрное Озеро (gvr:code=09010300711110000007135)
    # Озера Малые (gvr:code=14010501011111200009891)
}


patterns = {
    'whitelist_invalid_chars': re.compile(r'[^а-яА-ЯёЁ()\-\\\s]'),

    'double_spaces': re.compile(r'\s{2,}'),

    'hyphen': re.compile(r'\b(озеро|озера|озёра)[-–—]\b'),

    'OzErO': re.compile(r'\b(?!озеро|озера|озёра)[оО][зЗ][еЕёЁ][рР][оОаА]\b'),

    'ozer': re.compile(r'\b(?!озеро|озера|озёра)[оО][зЗ][еЕёЁ][рР][оОаА]*\b'),
    'ozeo': re.compile(r'\b(?!озеро|озера|озёра)[оО][зЗ][еЕёЁ][рР]*[оОаА]\b'),
    'ozro': re.compile(r'\b(?!озеро|озера|озёра)[оО][зЗ][еЕёЁ]*[рР][оОаА]\b'),
    'oero': re.compile(r'\b(?!озеро|озера|озёра)[оО][зЗ]*[еЕёЁ][рР][оОаА]\b'),
    'zero': re.compile(r'\b(?!озеро|озера|озёра)[оО]*[зЗ][еЕёЁ][рР][оОаА]\b'),

    'only_ozero_no_name': re.compile(r'^[оО][зЗ][еЕёЁ][рР][оОаА]$'),
    'small_letter': re.compile(r'^(?!озеро|озера|озёра)[а-я].*'),
}


def is_exception(osm_type, osm_id, name):
    if (osm_type, osm_id) not in unique:
        return any(p.search(name) for p in patterns.values())
