iso_codes: list[dict[str, str]] = [
    {
        "name": "Карелия",
        "iso": "RU-KR"
    },
    {
        "name": "Республика Саха (Якутия)",
        "iso": "RU-SA"
    },
    {
        "name": "Ханты-Мансийский автономный округ — Югра",
        "iso": "RU-KHM"
    },
    {
        "name": "Ленинградская область",
        "iso": "RU-LEN"
    },
    {
        "name": "Красноярский край",
        "iso": "RU-KYA"
    },
    {
        "name": "Мурманская область",
        "iso": "RU-MUR"
    },
    {
        "name": "Псковская область",
        "iso": "RU-PSK"
    },
    {
        "name": "Тюменская область",
        "iso": "RU-TYU"
    },
    {
        "name": "Чукотский автономный округ",
        "iso": "RU-CHU"
    },
    {
        "name": "Архангельская область",
        "iso": "RU-ARK"
    },
    {
        "name": "Алтайский край",
        "iso": "RU-ALT"
    },
    {
        "name": "Вологодская область",
        "iso": "RU-VLG"
    },
    {
        "name": "Курганская область",
        "iso": "RU-KGN"
    },
    {
        "name": "Челябинская область",
        "iso": "RU-CHE"
    },
    {
        "name": "Тверская область",
        "iso": "RU-TVE"
    },
    {
        "name": "Новгородская область",
        "iso": "RU-NGR"
    },
    {
        "name": "Камчатский край",
        "iso": "RU-KAM"
    },
    {
        "name": "Омская область",
        "iso": "RU-OMS"
    },
    {
        "name": "Ненецкий автономный округ",
        "iso": "RU-NEN"
    },
    {
        "name": "Забайкальский край",
        "iso": "RU-ZAB"
    },
    {
        "name": "Новосибирская область",
        "iso": "RU-NVS"
    },
    {
        "name": "Рязанская область",
        "iso": "RU-RYA"
    },
    {
        "name": "Ямало-Ненецкий автономный округ",
        "iso": "RU-YAN"
    },
    {
        "name": "Сахалинская область",
        "iso": "RU-SAK"
    },
    {
        "name": "Воронежская область",
        "iso": "RU-VOR"
    },
    {
        "name": "Хабаровский край",
        "iso": "RU-KHA"
    },
    {
        "name": "Томская область",
        "iso": "RU-TOM"
    },
    {
        "name": "Республика Алтай",
        "iso": "RU-AL"
    },
    {
        "name": "Нижегородская область",
        "iso": "RU-NIZ"
    },
    {
        "name": "Кировская область",
        "iso": "RU-KIR"
    },
    {
        "name": "Волгоградская область",
        "iso": "RU-VGG"
    },
    {
        "name": "Бурятия",
        "iso": "RU-BU"
    },
    {
        "name": "Свердловская область",
        "iso": "RU-SVE"
    },
    {
        "name": "Владимирская область",
        "iso": "RU-VLA"
    },
    {
        "name": "Башкортостан",
        "iso": "RU-BA"
    },
    {
        "name": "Чувашия",
        "iso": "RU-CU"
    },
    {
        "name": "Московская область",
        "iso": "RU-MOS"
    },
    {
        "name": "Самарская область",
        "iso": "RU-SAM"
    },
    {
        "name": "Республика Коми",
        "iso": "RU-KO"
    },
    {
        "name": "Татарстан",
        "iso": "RU-TA"
    },
    {
        "name": "Марий Эл",
        "iso": "RU-ME"
    },
    {
        "name": "Краснодарский край",
        "iso": "RU-KDA"
    },
    {
        "name": "Брянская область",
        "iso": "RU-BRY"
    },
    {
        "name": "Костромская область",
        "iso": "RU-KOS"
    },
    {
        "name": "Смоленская область",
        "iso": "RU-SMO"
    },
    {
        "name": "Амурская область",
        "iso": "RU-AMU"
    },
    {
        "name": "Иркутская область",
        "iso": "RU-IRK"
    },
    {
        "name": "Приморский край",
        "iso": "RU-PRI"
    },
    {
        "name": "Калмыкия",
        "iso": "RU-KL"
    },
    {
        "name": "Ивановская область",
        "iso": "RU-IVA"
    },
    {
        "name": "Карачаево-Черкесия",
        "iso": "RU-KC"
    },
    {
        "name": "Хакасия",
        "iso": "RU-KK"
    },
    {
        "name": "Астраханская область",
        "iso": "RU-AST"
    },
    {
        "name": "Оренбургская область",
        "iso": "RU-ORE"
    },
    {
        "name": "Магаданская область",
        "iso": "RU-MAG"
    },
    {
        "name": "Тамбовская область",
        "iso": "RU-TAM"
    },
    {
        "name": "Мордовия",
        "iso": "RU-MO"
    },
    {
        "name": "Тыва",
        "iso": "RU-TY"
    },
    {
        "name": "Автономная Республика Крым",
        "iso": "UA-43"
    },
    {
        "name": "Ярославская область",
        "iso": "RU-YAR"
    },
    {
        "name": "Еврейская автономная область",
        "iso": "RU-YEV"
    },
    {
        "name": "Ульяновская область",
        "iso": "RU-ULY"
    },
    {
        "name": "Пензенская область",
        "iso": "RU-PNZ"
    },
    {
        "name": "Калининградская область",
        "iso": "RU-KGD"
    },
    {
        "name": "Ростовская область",
        "iso": "RU-ROS"
    },
    {
        "name": "Дагестан",
        "iso": "RU-DA"
    },
    {
        "name": "Кемеровская область",
        "iso": "RU-KEM"
    },
    {
        "name": "Пермский край",
        "iso": "RU-PER"
    },
    {
        "name": "Ставропольский край",
        "iso": "RU-STA"
    },
    {
        "name": "Курская область",
        "iso": "RU-KRS"
    },
    {
        "name": "Липецкая область",
        "iso": "RU-LIP"
    },
    {
        "name": "Саратовская область",
        "iso": "RU-SAR"
    },
    {
        "name": "Кабардино-Балкария",
        "iso": "RU-KB"
    },
    {
        "name": "Санкт-Петербург",
        "iso": "RU-SPE"
    },
    {
        "name": "Калужская область",
        "iso": "RU-KLU"
    },
    {
        "name": "Тульская область",
        "iso": "RU-TUL"
    },
    {
        "name": "Москва",
        "iso": "RU-MOW"
    },
    {
        "name": "Удмуртия",
        "iso": "RU-UD"
    },
    {
        "name": "Белгородская область",
        "iso": "RU-BEL"
    },
    {
        "name": "Адыгея",
        "iso": "RU-AD"
    },
    {
        "name": "Орловская область",
        "iso": "RU-ORL"
    },
    {
        "name": "Северная Осетия — Алания",
        "iso": "RU-SE"
    },
    {
        "name": "Севастополь",
        "iso": "UA-40"
    },
    {
        "name": "Чеченская Республика",
        "iso": "RU-CE"
    },
]
